import xlrd
import math


stuInfos = [
    {'学号': 126541, '年级': 1, '班级': 12, '性别': '男', '语文': 87, '数学': 76, '英语': 83, '思品': 65},
    {'学号': 133291, '年级': 1, '班级': 12, '性别': '男', '语文': 45, '数学': 97, '英语': 83, '思品': 83},
    {'学号': 142421, '年级': 1, '班级': 24, '性别': '男', '语文': 57, '数学': 56, '英语': 67, '思品': 84},
    {'学号': 149711, '年级': 1, '班级': 12, '性别': ' 男', '语文': 98, '数学': 65, '英语': 86, '思品': 76},
    {'学号': 152141, '年级': 1, '班级': 6, '性别': '男', '语文': 87, '数学': 86, '英语': 48, '思品': 87},
    {'学号': 162641, '年级': 1, '班级': 12, '性别': '男', '语文': 69, '数学': 98, '英语': 73, '思品': 65}, 
    {'学号': 171191, '年级': 1, '班级': 6, '性别': '女', '语文': 75, '数学': 76, '英语': 85, '思品': 78}, 
    {'学号': 175451, '年级': 1, '班级': 12, '性别': '男', '语文': 76, '数学': 65, '英语': 84, '思品': 79}, 
    {'学号': 182261, '年级': 1, '班级': 12, '性别': '女', '语文': 74, '数学': 83, '英语': 82, '思品': 92}, 
    {'学号': 193831, '年级': 1, '班级': 6, '性别': '男', '语文': 88, '数学': 84, '英语': 99, '思品': 84}, 
    {'学号': 199461, '年级': 1, '班级': 12, '性别': '男', '语文': 86, '数学': 76, '英语': 78, '思品': 82},
    {'学号': 209191, '年级': 1, '班级': 12, '性别': '男', '语文': 85, '数学': 87, '英语': 85, '思品': 99},
    {'学号': 209381, '年级': 1, '班级': 24, '性别': '男', '语文': 83, '数学': 65, '英语': 84, '思品': 85},
    {'学号': 223081, '年级': 1, '班级': 12, '性别': '男', '语文': 83, '数学': 78, '英语': 83, '思品': 83}, 
    {'学号': 528911, '年级': 1, '班级': 12, '性别': '男', '语文': 67, '数学': 75, '英语': 79, '思品': 76}, 
    {'学号': 1080421, '年级': 1, '班级': 6, '性别': '男', '语文': 86, '数学': 45, '英语': 92, '思品': 68}, 
    {'学号': 1518801, '年级': 1, '班级': 12, '性别': '男', '语文': 48, '数学': 97, '英语': 84, '思品': 45},
    {'学号': 1522221, '年级': 1, '班级': 6, '性别': '男', '语文': 98, '数学': 94, '英语': 82, '思品': 57}, 
    {'学号': 1536991, '年级': 1, '班级': 12, '性别': '女', '语文': 98, '数学': 74, '英语': 99, '思品': 98},
    {'学号': 1537191, '年级': 1, '班级': 12, '性别': '男', '语文': 95, '数学': 73, '英语': 85, '思品': 87},
    {'学号': 1537391, '年级': 1, '班级': 12, '性别': '男', '语文': 96, '数学': 85, '英语': 83, '思品': 69}, 
    {'学号': 1537661, '年级': 1, '班级': 12, '性别': '男', '语文': 86, '数学': 84, '英语': 76, '思品': 75}, 
    {'学号': 1538211, '年级': 1, '班级': 12, '性别': '女', '语文': 89, '数学': 82, '英语': 68, '思品': 76}, 
    {'学号': 1540111, '年级': 1, '班级': 12, '性别': '男', '语文': 94, '数学': 99, '英语': 56, '思品': 74}, 
    {'学号': 1541631, '年级': 1, '班级': 12, '性别': '男', '语文': 74, '数学': 85, '英语': 77, '思品': 88}, 
    {'学号': 1541641, '年级': 1, '班级': 12, '性别': '男', '语文': 78, '数学': 83, '英语': 88, '思品': 86}, 
    {'学号': 1541761, '年级': 1, '班级': 12, '性别': '男', '语文': 85, '数学': 76, '英语': 64, '思品': 98}, 
    {'学号': 1542581, '年级': 1, '班级': 12, '性别': '男', '语文': 84, '数学': 68, '英语': 86, '思品': 98}, 
    {'学号': 1542681, '年级': 1, '班级': 12, '性别': '男', '语文': 83, '数学': 56, '英语': 33, '思品': 95}, 
    {'学号': 1542821, '年级': 1, '班级': 12, '性别': '女', '语文': 79, '数学': 77, '英语': 67, '思品': 96}, 
    {'学号': 1546771, '年级': 1, '班级': 12, '性别': '男', '语文': 92, '数学': 88, '英语': 78, '思品': 86}
]

#  如上有一部分学生的信息，请从给定的学生信息中用python实现以下功能
#  1. 计算每个学生的总成绩 计算方式： 语文 + 数学 + 英语 + 思品 = 总成绩
# for rowindex in range(0, len(stuInfos)):
# totalsub1=0
for item in stuInfos:
    sub1=item.get("语文")
    sub2=item.get("数学")
    sub3 = item.get("英语")
    sub4=item.get("思品")
    totalScore=sub1+sub2+sub3+sub4
    # print(sub1)
    # print(sub2)
    # print(sub3)
    print("the total score for each student:"+ str(totalScore))
#  2. 计算所有人各科平均成绩，如：语文平均成绩 = 语文总成绩 / 总人数
def Averagesub (k):
    totalsub=0
    for item in stuInfos:
        sub=item.get(k)
        totalsub+=sub
    averageSub=totalsub/len(stuInfos)
    return averageSub

print("语文的平均成绩："+ str(Averagesub("语文")))
print("语文的平均成绩："+ str(Averagesub("数学")))
print("语文的平均成绩："+ str(Averagesub("英语")))
print("语文的平均成绩："+ str(Averagesub("思品")))



#  3. 计算所有人综合的平均成绩, 计算方式： (语文平均成绩 + 数学平均成绩 + 英语平均成绩 + 思品平均成绩) / 4
def averageAll (a, b, c, d):
    averageAll=(a+b+c+d)/4
    return averageAll

averageFallsub=averageAll(Averagesub("语文"), Averagesub("数学"), Averagesub("英语"), Averagesub("思品"))
print("the averagescore for all people in all subjects (所有人综合的平均成绩):" + str(averageFallsub))


#  4. 计算每个人的绩点：
    #  90分(包含90分)到100之间绩点为 4.0  
    #  80分(包含80分)到90之间绩点为 3.0
    #  70分(包含70分)到80之间绩点为 2.0
    #  60分(包含60分)到70之间绩点为 1.0
    #  60分以下的绩点为0.0
    # 如：数据 {'语文': 87, '数学': 76, '英语': 83, '思品': 65}的绩点计算为：
    # 87分绩点为3.0   76分绩点为2.0  83分绩点为 3.0 65分绩点为1.0，则总绩点为 3.0 + 2.0 + 3.0 + 1.0 = 9.0



def transfer(grade):
    if 90 <= grade < 100:
        subpoint=4
    elif 80<=grade<90:
        subpoint=3
    elif 70<=grade<80:
        subpoint=2
    elif 60<=grade<70:
        subpoint=1
    else:
        subpoint=0
    return subpoint

stugrade=0
for item in stuInfos:
    subpoint1=transfer(item.get("语文"))
    subpoint2=transfer(item.get("数学"))
    subpoint3= transfer(item.get("英语"))
    subpoint4=transfer(item.get("思品"))
    totalgrade=subpoint1+subpoint2+subpoint3+subpoint4
    print("the total grade for each student（每个人的绩点）:"+ str(totalgrade))

# 5. 计算所有人的平均绩点。
    stugrade += totalgrade
averageGrade = stugrade/len(stuInfos)
print("所有人的平均绩点："+str(averageGrade))


# def Gradepoint(k):
#     for item in stuInfos:
#         grade=item.get(k)
#         if 90 <= grade < 100:
#             subpoint=4
#         elif 80<=grade<90:
#             subpoint=3
#         elif 70<=grade<80:
#             subpoint=2
#         elif 60<=grade<70:
#             subpoint=1
#         else:
#             subpoint=0
#     return subpoint
#
# Grade1=Gradepoint("语文")
# Grade2=Gradepoint("数学")
# Grade3=Gradepoint("英语")
# Grade4=Gradepoint("思品")
#
# gradepoint=Grade1+Grade2+Grade3+Grade4
# print(gradepoint)




